namespace SimpleConsoleApp
{
    // Объявление класса.
    internal class Program
    {
        /* Объявление метода.
         * Статический метод Main, возвращающий void или Task, а также принимающий массив строк
         * в качестве параметра, трактуется компилятором как точка входа в приложение. Такой метод в приложении
         * может быть только один. */
        static void Main(string[] args)
        {
            // Выводим в консоль приветственное сообщение.
            Console.WriteLine("Hello, Group!");
        }
    }
}
